[{"name":"Luke Skywalker","description":"Luke Skywalker fue un humano sensible a la Fuerza y un Maestro Jedi quien, junto a su hermana gemela, la Princesa Leia Organa, luchó en contra del gobierno del Imperio Galáctico durante la Guerra Civil Galáctica. Hijo del Caballero Jedi Anakin Skywalker y de la Senadora Padmé Amidala de Naboo, Luke nació poco después del final de la Guerras Clon el 19 ABY. Como resultado de la muerte de su madre y de la caída de su padre al lado oscuro de la Fuerza, Luke fue enviado al planeta natal de Anakin, Tatooine, para vivir con sus relativos, Owen y Beru Lars, durante los primeros 19 años de su vida. Después de sus muertes a manos del Imperio, Luke se convirtió en aprendiz del antiguo maestro de su padre, Obi-Wan Kenobi, con el fin de aprender los caminos de la Fuerza y convertirse en un Jedi. Con la ayuda de los contrabandistas Han Solo y Chewbacca, Skywalker rescato a Leia Organa de las garras del Imperio, pero perdió a su maestro, quien murió mientras confrontaba al Lord Sith Darth Vader. En la Batalla de Yavin, Skywalker logró destruir la estación de batalla y superarma del Imperio, la Estrella de la Muerte, salvando así a la Alianza para Restaurar la República de la destrucción.","img":"http://localhost:3977/api/starwars/img/Luke.jpg","force":"Light","star":5},{"name":"Stormtroopers","description":"Los soldados de asalto fueron las tropas de asalto del Imperio Galáctico. Los ciudadanos se referían a ellos como Cabezas de cubo, un apodo despectivo inspirado en los cascos en forma de cubo de los soldados de asalto. Como miembros del Cuerpo de Soldados de asalto, una rama independiente que operaba bajo el Ejército Imperial, los soldados de asalto representaban la columna vertebral del Fuerzas Armadas Imperiales—entrenados para la obediencia total al mando jerárquico, así como la lealtad absoluta al Emperador Sheev Palpatine y al régimen Imperial. Los soldados de asalto fueron entrenados en Academias Imperiales, y usaron una variedad de armas.","img":"http://localhost:3977/api/starwars/img/Stormtrooper.png","force":"Dark","star":3},{"name":"Han Solo","description":"Han Solo, anteriormente conocido como Han antes de que un Oficial de Reclutamiento Imperial le diera el apellido Solo, era un hombre humano contrabandista que se convirtió en un líder en la Alianza para Restaurar la República y una figura instrumental en la derrota del Imperio Galáctico durante la Guerra Civil Galáctica. Él procedía de Corellia y se convirtió en un contrabandista al servicio de Jabba el Hutt, incluso completando el Corredor de Kessel en menos de trece parsecs con su preciada nave, el Halcón Milenario. Era el yerno del Caballero Jedi caído Anakin Skywalker y la Senadora Padmé Amidala, esposo de la Princesa Leia Organa, cuñado del Maestro Jedi Luke Skywalker, padre de Ben Solo, rivales y amigos cercanos de su contrabandista Lando Calrissian y mejores amigos del Wookie Chewbacca, su copiloto de confianza que juró una deuda de vida con el contrabandista corelliano. Solo entró en conflicto con Jabba después de deshacerse de un cargamento de especias para evitar problemas con el Imperio, lo que le debió al Hutt una gran cantidad de dinero como resultado. Su fortuna parecía haber cambiado cuando acordó contratar a Luke Skywalker, Obi-Wan Kenobi, y los droides R2-D2 y C-3PO a Alderaan, pero quedó atrapado en la rebelión contra el Imperio y, después de ayudar a escapar a Leia Organa de la Estrella de la Muerte, luchó brevemente en la Batalla de Yavin, lo que permitió a Skywalker destruir la superarma. Solo luchó con la Rebelión durante varios años después, participando en numerosas operaciones y batallas contra el Imperio.","img":"http://localhost:3977/api/starwars/img/HanSolo.png","force":"Light","star":3},{"name":"Boba Fett","description":"Boba Fett fue un cazarrecompensas humano, y el clon del infame cazarrecompensas Jango Fett. Boba fue creado por los clonadores de Kamino y era físicamente idéntico a los soldados clon creados para el Gran Ejército de la República, aunque Boba fue inalterado y no creció aceleradamente como los demás clones. Criado como el hijo de Jango, Boba aprendió las habilidades de combate necesarias para algún día convertirse en cazarrecompensas por derecho propio.","img":"http://localhost:3977/api/starwars/img/Boba_fett.jpg","force":"Dark","star":3},{"name":"Darth Vader","description":"Anakin Skywalker fue un humano sensible a la Fuerza que sirvió a la República Galáctica como Caballero Jedi y más tarde al Imperio Galáctico como el Lord Sith Darth Vader. Creído de haber sido concebido por la Fuerza, nació de Shmi Skywalker y pasó a residir en el planeta del Borde Exterior Tatooine cuando era niño, donde él y su madre fueron esclavos de la prominente señora del crimen Gardulla la Hutt hasta que pasaron a ser propiedad de un chatarrero local toydariano llamado Watto. Un ingeniero prodigioso, Skywalker construyó al droide de protocolo C-3PO usando piezas que había recolectado para ayudar a su madre. Poco después, durante la Crisis de Naboo, fue descubierto por el Maestro Jedi Qui-Gon Jinn y su aprendiz, Obi-Wan Kenobi, quienes lo liberaron de la esclavitud tras participar Skywalker en una exitosa carrera de vainas. Llevándolo ante la Orden Jedi, Jinn presentó a Skywalker como el Elegido de la Profecía Jedi, destinado a destruir a los Sith y traer el equilibrio a la Fuerza.","img":"http://localhost:3977/api/starwars/img/Anakin_Skywalker.png","force":"Dark","star":5},{"name":"Yoda","description":"Yoda un miembro masculino de una especie misteriosa, era un reverenciado Maestro Jedi que sirvió como Gran Maestro de la Orden Jedi en los últimos días de la República Galáctica. Era famoso dentro de la Orden por su sabiduría, poderes de la Fuerza y combate con sables de luz, y vivió durante casi 900 años. Su tiempo durante los últimos días de la Orden Jedi y más allá lo convirtió en una figura consecuente en la historia galáctica.","img":"http://localhost:3977/api/starwars/img/Yoda.jpg","force":"Light","star":3},{"name":"C-3PO","description":"'C-3PO, a veces deletreado Cetrespeó y referido a menudo simplemente como Trespeó, era un droide de protocolo unidad 3PO diseñado para interactuar con seres orgánicos, programado principalmente para la etiqueta y el protocolo. Hablaba con fluidez más de siete millones de formas de comunicación, y desarrolló una personalidad exigente y propensa a las preocupaciones a lo largo de sus muchas décadas de operación. Junto con su contraparte, el droide astromecánico R2-D2, C-3PO constantemente se encontró involucrado directamente en momentos cruciales de la historia galáctica, y ayudó a salvar la galaxia en muchas ocasiones. C-3PO fue reconstruido a partir de piezas de repuesto por Anakin Skywalker, un esclavo humano que vivía en Mos Espa, una ciudad en el mundo del Borde Exterior de Tatooine. La memoria de C-3PO se borró, aunque la memoria de R2-D2 no. C-3PO y R2-D2 fueron asignados al crucero de Alderaan Tantive IV, donde sirvieron al Senador Bail Organa durante diecinueve años. En algún momento durante este tiempo, la pierna derecha de 3PO estaba equipada con la de otro droide.","img":"http://localhost:3977/api/starwars/img/C-3PO.png","force":"Light","star":2},{"name":"R2-D2","description":"R2-D2, pronunciado Erredós Dedós y a menudo referido como Erredós, era un droide astromecánico de la serie R2 fabricado por Industrias Automaton que tenía una programación masculina. Era un droide inteligente y valiente que sirvio a una multitud de maestros a lo largo de su vida, y nunca recibió un borrado de memoria completo (aparte de un borrado mental parcial por Cad Bane durante la crisis de rehenes del Senado) ni ha recibido programación nueva, con estos factores desarrollo una actitud aventurera e independiente. A menudo se encontraba en momentos cruciales en la historia galáctica, y su valentía e ingenio a menudo salvaba a la galaxia una y otra vez.","img":"http://localhost:3977/api/starwars/img/R2-D2.png","force":"Light","star":5},{"name":"Chewbacca","description":"Chewbacca, llamado afectuosamente Chewie por sus amigos, fue un guerrero wookiee, un contrabandista y un luchador de resistencia que peleó en las Guerras Clon, la Guerra Civil Galáctica y el Conflicto Primera Orden-Resistencia. Fue criado en el planeta Kashyyyk y se convirtió en un líder militar. Durante las Guerras Clon, fue capturado por esclavistas trandoshanos y hecho prisionero en Wasskah, donde trabajó con otra cautiva, la Comandante Jedi Ahsoka Tano, para escapar. Más tarde comandó a las fuerzas wokiees durante la Batalla de Kashyyyk junto al Gran Ejército de la República, liderado por el Maestro Jedi Yoda. Durante la batalla, una de las últimas de la guerra, los soldados clon de Yoda recibieron la Orden 66 del Canciller Supremo Sheev Palpatine y, con la ayuda de Chewbacca, Yoda escapó de Kashyyyk y la destrucción de la Orden Jedi.","img":"http://localhost:3977/api/starwars/img/Chewbacca.png","force":"Light","star":2},{"name":"Darth Maul","description":"Darth Maul fue un zabrak dathomiriano y Lord Sith que vivió durante los últimos años de la República Galáctica. Maul nació de la madre Talzin y se crió como un Hermano de la Noche en Dathomir, antes de ser tomado por Darth Sidious como su aprendiz . Maul aprendió el arte del combate con sables láser y tomó una hoja doble de sable láser como sable de luz personal, convirtiéndose en un arma para ser utilizada en contra de la Orden Jedi.","img":"http://localhost:3977/api/starwars/img/Darth_Maul.jpg","force":"Dark","star":4}]